In [34]:
import pandas as pd
import numpy as np
from functools import reduce

**Basico** - conferido

In [35]:
dfBasicoAlagoas = pd.read_csv('dataAgrupados/Basico_AL.csv', sep = ';', encoding = 'unicode_escape')

In [36]:
dfBasicoAlagoas = dfBasicoAlagoas[['Cod_setor','V003', 'V005', 'V009', 'V011']]

In [37]:
dfBasicoAlagoas = dfBasicoAlagoas.replace('X', 0, regex= True)

In [38]:
dfBasicoAlagoas.head()

         Cod_setor  V003    V005    V009    V011
0  270010205000001  3,77  633,74  348,69  610,98
1  270010205000002  3,99  773,12  402,86     700
2  270010205000003  3,92  514,72  293,06  519,13
3  270010205000004  3,44  503,38  303,83  576,76
4  270010205000005  4,61  304,49   178,1  363,82

In [39]:
dfBasicoAlagoas = dfBasicoAlagoas.replace(',', '.', regex= True)

In [40]:
dfBasicoAlagoas = dfBasicoAlagoas.astype({'V003':'float','V005':'float','V009':'float','V011':'float'})

In [41]:
dfBasicoAlagoas.rename(columns = {'V003':'MediaMoradorDomicilio',
                     'V005':'RendaMediaDomicilio',
                     'V009':'RendaMediaPerCapitaGeral',
                     'V011':'RendaMediaPerCapitaComRendimento'}, inplace = True)

**Domicilio01** - conferido

In [42]:
dfDomicilio01Alagoas = pd.read_csv('dataAgrupados/Domicilio01_AL.csv', sep = ';', encoding = 'unicode_escape')

In [43]:
dfDomicilio01Alagoas = dfDomicilio01Alagoas.replace('X', 0, regex= True)

In [44]:
dfDomicilio01Alagoas = dfDomicilio01Alagoas[['Cod_setor',
                                       'V001', 'V003', 'V005', 'V008','V050',
                                       'V050' ,'V051' ,'V052' ,'V053' ,'V054' ,'V055' ,
                                       'V056' ,'V057' ,'V058' ,'V059' ,]]

In [45]:
dfDomicilio01Alagoas.rename(columns = {
'V001':'nAbsDomicilios' , 
'V003': 'nAbsDomiciliosCasa', 
'V005': 'nAbsDomiciliosApto', 
'V008': 'nAbsImoveisAlugados', 
'V050':'nAbs1PessoasDomicilio',
'V051':'nAbs2PessoasDomicilio',
'V052':'nAbs3PessoasDomicilio',
'V053':'nAbs4PessoasDomicilio',
'V054':'nAbs5PessoasDomicilio',
'V055':'nAbs6PessoasDomicilio',
'V056':'nAbs7PessoasDomicilio',
'V057':'nAbs8PessoasDomicilio',
'V058':'nAbs9PessoasDomicilio',
'V059':'nAbs10PessoasDomicilio'}, inplace = True)

In [46]:
dfDomicilio01Alagoas['nAbs5ouMaisPessoasDomicilio'] = dfDomicilio01Alagoas['nAbs5PessoasDomicilio'] +dfDomicilio01Alagoas['nAbs6PessoasDomicilio'] + dfDomicilio01Alagoas['nAbs7PessoasDomicilio'] + dfDomicilio01Alagoas['nAbs8PessoasDomicilio']
+ dfDomicilio01Alagoas['nAbs9PessoasDomicilio'] + dfDomicilio01Alagoas['nAbs10PessoasDomicilio']

0        34
1        34
2        12
3        10
4       713
       ...
3719     22
3720     00
3721     11
3722     11
3723     22
Length: 3724, dtype: object

In [47]:
dfDomicilio01Alagoas.drop(['nAbs5PessoasDomicilio', 'nAbs6PessoasDomicilio', 'nAbs7PessoasDomicilio',
                        'nAbs8PessoasDomicilio', 'nAbs9PessoasDomicilio', 'nAbs10PessoasDomicilio'], axis =1, inplace = True)

**Domicilio02** - conferido

In [48]:
dfDomicilio02Alagoas = pd.read_csv('dataAgrupados/Domicilio02_AL.csv', sep = ';', encoding = 'unicode_escape')

In [49]:
dfDomicilio02Alagoas = dfDomicilio02Alagoas.replace('X', 0, regex= True)

In [50]:
dfDomicilio02Alagoas = dfDomicilio02Alagoas.astype(int)

In [51]:
dfDomicilio02Alagoas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3724 entries, 0 to 3723
Columns: 134 entries, Cod_setor to V132
dtypes: int64(134)
memory usage: 3.8 MB

In [52]:
dfDomicilio02Alagoas = dfDomicilio02Alagoas[['Cod_setor',
                                       'V001', 'V003', 'V005', 'V008']]

In [53]:
dfDomicilio02Alagoas.rename(columns = {
'V001':'nAbsHabitantes' , 
'V003': 'nAbsMoradoresCasa', 
'V005': 'nAbsMoradoresApto', 
'V008': 'nAbsMoradoresImoveisAlugados', 
}, inplace = True)

In [54]:
dfDomicilio02Alagoas.head()

,Cod_setor,nAbsHabitantes,nAbsMoradoresCasa,nAbsMoradoresApto,nAbsMoradoresImoveisAlugados
0,270010205000001,1195,1188,0,162
1,270010205000002,886,886,0,72
2,270010205000003,1083,1083,0,179
3,270010205000004,265,265,0,0
4,270010205000005,1244,1244,0,4

**Pessoa13** - conferido

In [55]:
dfPessoa13Alagoas = pd.read_csv('dataAgrupados/Pessoa13_AL.csv', sep = ';', encoding = 'unicode_escape')

In [56]:
dfPessoa13Alagoas = dfPessoa13Alagoas[['Cod_setor', 'V001']]

In [57]:
dfPessoa13Alagoas = dfPessoa13Alagoas.replace('X', 0, regex= True)

In [58]:
dfPessoa13Alagoas.rename(columns= {'V001':'nAbsConjuges'}, inplace = True)

In [59]:
dfPessoa13Alagoas.head()

         Cod_setor  nAbsConjuges
0  270010205000001          1195
1  270010205000002           886
2  270010205000003          1083
3  270010205000004           265
4  270010205000005          1244

**Pessoa11** - conferido

In [60]:
dfPessoa11Alagoas = pd.read_csv('dataAgrupados/Pessoa11_AL.csv', sep = ';', encoding = 'unicode_escape')

In [61]:
dfPessoa11Alagoas = dfPessoa11Alagoas[['Cod_setor', 'V001']]

In [62]:
dfPessoa11Alagoas = dfPessoa11Alagoas.replace('X', 0, regex= True)

In [63]:
dfPessoa11Alagoas.rename(columns= {'V001':'nAbsHomensResidentes'}, inplace = True)

**Pessoa12** - conferido

In [64]:
dfPessoa12Alagoas = pd.read_csv('dataAgrupados/Pessoa12_AL.csv', sep = ';', encoding = 'unicode_escape')

In [65]:
dfPessoa12Alagoas = dfPessoa12Alagoas.replace('X', 0, regex= True)

In [66]:
dfPessoa12Alagoas = dfPessoa12Alagoas[['Cod_setor', 'V001']]

In [67]:
dfPessoa12Alagoas.head()

         Cod_setor  V001
0  270010205000001   605
1  270010205000002   452
2  270010205000003   560
3  270010205000004   135
4  270010205000005   620

In [68]:
dfPessoa12Alagoas.rename(columns= {'V001':'nAbsMulheresResidentes'}, inplace = True)

In [69]:
dfPessoa12Alagoas.head()

         Cod_setor  nAbsMulheresResidentes
0  270010205000001                     605
1  270010205000002                     452
2  270010205000003                     560
3  270010205000004                     135
4  270010205000005                     620

**DomicilioRenda** - conferido

In [70]:
dfDomicilioRendaAlagoas = pd.read_csv('dataAgrupados/DomicilioRenda_AL.csv', sep = ';', encoding = 'unicode_escape')

In [71]:
dfDomicilioRendaAlagoas = dfDomicilioRendaAlagoas[['Cod_setor',
                                             'V002', 'V003', 'V004']]

In [72]:
dfDomicilioRendaAlagoas = dfDomicilioRendaAlagoas.replace('X', 0, regex= True)

In [73]:
dfDomicilioRendaAlagoas = dfDomicilioRendaAlagoas.astype(int)

In [74]:
dfDomicilioRendaAlagoas.rename(columns = {'V002':'TotalRendNomMensalDomParticulares',
                                       'V003':'TotalRendimentoNomMensalDomParticularesPermanentes',
                                       'V004':'TotalRendimentoNomMensalDomParitulcaresImprovisados'}
                            , inplace = True)

In [75]:
dfDomicilioRendaAlagoas.head()

,Cod_setor,TotalRendNomMensalDomParticulares,TotalRendimentoNomMensalDomParticularesPermanentes,TotalRendimentoNomMensalDomParitulcaresImprovisados
0,270010205000001,343926,343926,0
1,270010205000002,295849,295849,0
2,270010205000003,253724,253724,0
3,270010205000004,68058,68058,0
4,270010205000005,170268,170268,0

**ResponsavelRenda** - conferido

In [76]:
dfResponsavelRendaAlagoas = pd.read_csv('dataAgrupados/ResponsavelRenda_AL.csv', sep = ';', encoding = 'unicode_escape')

In [77]:
dfResponsavelRendaAlagoas = dfResponsavelRendaAlagoas[['Cod_setor', 
                                                 'V001','V002', 'V003',
                                                 'V004','V005', 'V006',
                                                 'V007','V008', 'V009']]

In [78]:
dfResponsavelRendaAlagoas = dfResponsavelRendaAlagoas.replace('X', 0, regex= True)

In [79]:
dfResponsavelRendaAlagoas = dfResponsavelRendaAlagoas.astype(int)

In [80]:
dfResponsavelRendaAlagoas['nAbsPessoasClasseE'] = dfResponsavelRendaAlagoas['V001'] +dfResponsavelRendaAlagoas['V002'] + dfResponsavelRendaAlagoas['V003']

In [81]:
dfResponsavelRendaAlagoas['nAbsPessoasClasseD'] = dfResponsavelRendaAlagoas['V004']

In [82]:
dfResponsavelRendaAlagoas['nAbsPessoasClasseC'] = dfResponsavelRendaAlagoas['V005'] +dfResponsavelRendaAlagoas['V006']

In [83]:
dfResponsavelRendaAlagoas['nAbsPessoasClasseB'] = dfResponsavelRendaAlagoas['V007']

In [84]:
dfResponsavelRendaAlagoas['nAbsPessoasClasseA'] = dfResponsavelRendaAlagoas['V008'] +  dfResponsavelRendaAlagoas['V009']

In [85]:
dfResponsavelRendaAlagoas.drop(['V001', 'V002', 'V003',
                        'V004', 'V005', 'V006', 'V007', 'V008', 'V009'], axis =1, inplace = True)

In [86]:
dfResponsavelRendaAlagoas.head()

,Cod_setor,nAbsPessoasClasseE,nAbsPessoasClasseD,nAbsPessoasClasseC,nAbsPessoasClasseB,nAbsPessoasClasseA
0,270010205000001,253,7,17,1,1
1,270010205000002,173,12,13,0,3
2,270010205000003,220,9,11,0,0
3,270010205000004,55,4,3,0,0
4,270010205000005,224,3,0,0,0

**DATAFRAME TOTAL.**

In [87]:
data_frames = [dfBasicoAlagoas, dfDomicilio01Alagoas, dfDomicilio02Alagoas, dfPessoa13Alagoas, dfPessoa11Alagoas, dfPessoa12Alagoas,
               dfDomicilioRendaAlagoas, dfResponsavelRendaAlagoas]

In [88]:
dfTotalAlagoas = reduce(lambda  left,right: pd.merge(left,right,on=['Cod_setor'],
                                            how='inner'), data_frames)

In [89]:
dfTotalAlagoas.head()

,Cod_setor,MediaMoradorDomicilio,RendaMediaDomicilio,RendaMediaPerCapitaGeral,RendaMediaPerCapitaComRendimento,nAbsDomicilios,nAbsDomiciliosCasa,nAbsDomiciliosApto,nAbsImoveisAlugados,nAbs1PessoasDomicilio,...,nAbsHomensResidentes,nAbsMulheresResidentes,TotalRendNomMensalDomParticulares,TotalRendimentoNomMensalDomParticularesPermanentes,TotalRendimentoNomMensalDomParitulcaresImprovisados,nAbsPessoasClasseE,nAbsPessoasClasseD,nAbsPessoasClasseC,nAbsPessoasClasseB,nAbsPessoasClasseA
0,270010205000001,3.77,633.74,348.69,610.98,322,315,0,47,22,...,590,605,343926,343926,0,253,7,17,1,1
1,270010205000002,3.99,773.12,402.86,700.00,222,222,0,19,14,...,434,452,295849,295849,0,173,12,13,0,3
2,270010205000003,3.92,514.72,293.06,519.13,276,276,0,52,13,...,523,560,253724,253724,0,220,9,11,0,0
3,270010205000004,3.44,503.38,303.83,576.76,77,77,0,0,9,...,130,135,68058,68058,0,55,4,3,0,0
4,270010205000005,4.61,304.49,178.10,363.82,270,270,0,1,19,...,624,620,170268,170268,0,224,3,0,0,0

In [90]:
dfTotalAlagoas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3724 entries, 0 to 3723
Data columns (total 30 columns):
 #   Column                                               Non-Null Count  Dtype
---  ------                                               --------------  -----
 0   Cod_setor                                            3724 non-null   int64
 1   MediaMoradorDomicilio                                3714 non-null   float64
 2   RendaMediaDomicilio                                  3714 non-null   float64
 3   RendaMediaPerCapitaGeral                             3724 non-null   float64
 4   RendaMediaPerCapitaComRendimento                     3718 non-null   float64
 5   nAbsDomicilios                                       3724 non-null   int64
 6   nAbsDomiciliosCasa                                   3724 non-null   object
 7   nAbsDomiciliosApto                                   3724 non-null   object
 8   nAbsImoveisAlugados                                  3724 non-null   object
 9   nAbs1PessoasDomicilio                                3724 non-null   object
 10  nAbs1PessoasDomicilio                                3724 non-null   object
 11  nAbs2PessoasDomicilio                                3724 non-null   object
 12  nAbs3PessoasDomicilio                                3724 non-null   object
 13  nAbs4PessoasDomicilio                                3724 non-null   object
 14  nAbs5ouMaisPessoasDomicilio                          3724 non-null   object
 15  nAbsHabitantes                                       3724 non-null   int64
 16  nAbsMoradoresCasa                                    3724 non-null   int64
 17  nAbsMoradoresApto                                    3724 non-null   int64
 18  nAbsMoradoresImoveisAlugados                         3724 non-null   int64
 19  nAbsConjuges                                         3724 non-null   int64
 20  nAbsHomensResidentes                                 3724 non-null   int64
 21  nAbsMulheresResidentes                               3724 non-null   int64
 22  TotalRendNomMensalDomParticulares                    3724 non-null   int64
 23  TotalRendimentoNomMensalDomParticularesPermanentes   3724 non-null   int64
 24  TotalRendimentoNomMensalDomParitulcaresImprovisados  3724 non-null   int64
 25  nAbsPessoasClasseE                                   3724 non-null   int64
 26  nAbsPessoasClasseD                                   3724 non-null   int64
 27  nAbsPessoasClasseC                                   3724 non-null   int64
 28  nAbsPessoasClasseB                                   3724 non-null   int64
 29  nAbsPessoasClasseA                                   3724 non-null   int64
dtypes: float64(4), int64(17), object(9)
memory usage: 901.9+ KB

In [91]:
dfTotalAlagoas.to_csv('Alagoas.csv', sep= ';', encoding = 'utf-8')